In [3]:
import pandas as pd

In [4]:
empids=[101,102,103,104,105,106,107,108,109,110]
names=['aniket','Omkar','Rahul','Ashu','Avinash','Raj','Abhi','Annu','Shivansh','Om']

In [5]:
empid_series=pd.Series(empids,name="EmpID")
name_series=pd.Series(names,name="Name")

In [7]:
print(name_series)

0      aniket
1       Omkar
2       Rahul
3        Ashu
4     Avinash
5         Raj
6        Abhi
7        Annu
8    Shivansh
9          Om
Name: Name, dtype: object

In [12]:
df=pd.DataFrame({'EmpId':empid_series,'Name': name_series})

In [13]:
print(df)

   EmpId      Name
0    101    aniket
1    102     Omkar
2    103     Rahul
3    104      Ashu
4    105   Avinash
5    106       Raj
6    107      Abhi
7    108      Annu
8    109  Shivansh
9    110        Om

In [14]:
df.head()

   EmpId     Name
0    101   aniket
1    102    Omkar
2    103    Rahul
3    104     Ashu
4    105  Avinash

In [15]:
df.tail()

   EmpId      Name
5    106       Raj
6    107      Abhi
7    108      Annu
8    109  Shivansh
9    110        Om

In [16]:
df.to_csv('MRecord.csv', index=False)